# 列表表达式基础使用
lst = [i for i in range(10)]
print(lst)
# >>> [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

# 前面一段是表达式 i**2
lst = [i ** 2 for i in range(10)]
print(lst)
# >>>[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

# 也可以用双层循环, 前面外循环，后面内循环
lst = [f'{i}-{j}' for i in range(2) for j in range(5)]
print(lst)
# >>>['0-0', '0-1', '0-2', '0-3', '0-4', '1-0', '1-1', '1-2', '1-3', '1-4']

# 也可以用n层循环, 前面外循环，后面内循环
lst = [f'{i}-{j}-{k}' for i in range(2) for j in range(3) for k in range(4)]
print(lst)
# >>>['0-0-0', '0-0-1', '0-0-2', '0-0-3', '0-1-0', '0-1-1', '0-1-2', '0-1-3', '0-2-0', '0-2-1', '0-2-2', '0-2-3',
# '1-0-0', '1-0-1', '1-0-2', '1-0-3', '1-1-0', '1-1-1', '1-1-2', '1-1-3', '1-2-0', '1-2-1', '1-2-2', '1-2-3']

# 可以添加条件
lst = [i for i in range(50) if i % 5 == 0]
print(lst)
# >>>[0, 5, 10, 15, 20, 25, 30, 35, 40, 45]

# 可以添加条件在内外循环中
lst = ['{}-{}'.format(i, j) for i in range(10) if i % 5 == 0 for j in range(2)]
print(lst)
# >>>['0-0', '0-1', '5-0', '5-1']
